# Orga-Dete YOLO11n — MPCA + EMASlideLoss
# Based on yolo11.yaml, MPCA added after C2PSA
# BiFPN integration needs more work (Detect head requires list input)
# Phase 1: MPCA only (zero-cost addition)
# Phase 2: BiFPN (requires custom head)
# Phase 3: EMASlideLoss (custom training loss)
# Ref: Huang et al., Applied Sciences 2025

nc: 1  # organoid (single class)

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [256, False]] # 4 — P3 output
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]  # 6 — P4 output
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]    # 9
  - [-1, 2, C2PSA, [1024]]      # 10
  - [-1, 1, MPCA, [1024]]       # 11 — Orga-Dete MPCA, P5 output

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]       # cat backbone P4
  - [-1, 2, C3k2, [512, False]]     # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]       # cat backbone P3
  - [-1, 2, C3k2, [256, False]]     # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]      # cat head P4
  - [-1, 2, C3k2, [512, False]]     # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]      # cat head P5 (with MPCA)
  - [-1, 2, C3k2, [1024, True]]     # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)
